wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/can_reg.h
#define CAN_IF_CMASK_DATAA_Pos           (1)                                               /*!< CAN_IF_T::CMASK: DATAA Position        */
#define CAN_IF_CMASK_DATAA_Msk           (0x1ul << CAN_IF_CMASK_DATAA_Pos)                 /*!< CAN_IF_T::CMASK: DATAA Mask            */

#define CAN_IF_CMASK_TXRQSTNEWDAT_Pos    (2)                                               /*!< CAN_IF_T::CMASK: TXRQSTNEWDAT Position */
#define CAN_IF_CMASK_TXRQSTNEWDAT_Msk    (0x1ul << CAN_IF_CMASK_TXRQSTNEWDAT_Pos)          /*!< CAN_IF_T::CMASK: TXRQSTNEWDAT Mask     */

#define CAN_IF_CMASK_CLRINTPND_Pos       (3)                                               /*!< CAN_IF_T::CMASK: CLRINTPND Position    */
#define CAN_IF_CMASK_CLRINTPND_Msk       (0x1ul << CAN_IF_CMASK_CLRINTPND_Pos)             /*!< CAN_IF_T::CMASK: CLRINTPND Mask        */

#define CAN_IF_CMASK_CONTROL_Pos         (4)                                               /*!< CAN_IF_T::CMASK: CONTROL Position      */
#define CAN_IF_CMASK_CONTROL_Msk         (0x1ul << CAN_IF_CMASK_CONTROL_Pos)               /*!< CAN_IF_T::CMASK: CONTROL Mask          */

#define CAN_IF_CMASK_ARB_Pos             (5)                                               /*!< CAN_IF_T::CMASK: ARB Position          */
#define CAN_IF_CMASK_ARB_Msk             (0x1ul << CAN_IF_CMASK_ARB_Pos)                   /*!< CAN_IF_T::CMASK: ARB Mask              */

#define CAN_IF_CMASK_MASK_Pos            (6)                                               /*!< CAN_IF_T::CMASK: MASK Position         */
#define CAN_IF_CMASK_MASK_Msk            (0x1ul << CAN_IF_CMASK_MASK_Pos)                  /*!< CAN_IF_T::CMASK: MASK Mask             */

#define CAN_IF_CMASK_WRRD_Pos            (7)                                               /*!< CAN_IF_T::CMASK: WRRD Position         */
#define CAN_IF_CMASK_WRRD_Msk            (0x1ul << CAN_IF_CMASK_WRRD_Pos)                  /*!< CAN_IF_T::CMASK: WRRD Mask             */

#define CAN_IF_MASK1_MSK_Pos             (0)                                               /*!< CAN_IF_T::MASK1: MSK Position          */
#define CAN_IF_MASK1_MSK_Msk             (0xfffful << CAN_IF_MASK1_MSK_Pos)                /*!< CAN_IF_T::MASK1: MSK Mask              */

#define CAN_IF_MASK2_MSK_Pos             (0)                                               /*!< CAN_IF_T::MASK2: MSK Position          */
#define CAN_IF_MASK2_MSK_Msk             (0x1ffful << CAN_IF_MASK2_MSK_Pos)                /*!< CAN_IF_T::MASK2: MSK Mask              */

#define CAN_IF_MASK2_MDIR_Pos            (14)                                              /*!< CAN_IF_T::MASK2: MDIR Position         */
#define CAN_IF_MASK2_MDIR_Msk            (0x1ul << CAN_IF_MASK2_MDIR_Pos)                  /*!< CAN_IF_T::MASK2: MDIR Mask             */

#define CAN_IF_MASK2_MXTD_Pos            (15)                                              /*!< CAN_IF_T::MASK2: MXTD Position         */
#define CAN_IF_MASK2_MXTD_Msk            (0x1ul << CAN_IF_MASK2_MXTD_Pos)                  /*!< CAN_IF_T::MASK2: MXTD Mask             */

#define CAN_IF_ARB1_ID_Pos               (0)                                               /*!< CAN_IF_T::ARB1: ID Position            */
#define CAN_IF_ARB1_ID_Msk               (0xfffful << CAN_IF_ARB1_ID_Pos)                  /*!< CAN_IF_T::ARB1: ID Mask                */

#define CAN_IF_ARB2_ID_Pos               (0)                                               /*!< CAN_IF_T::ARB2: ID Position            */
#define CAN_IF_ARB2_ID_Msk               (0x1ffful << CAN_IF_ARB2_ID_Pos)                  /*!< CAN_IF_T::ARB2: ID Mask                */

#define CAN_IF_ARB2_DIR_Pos              (13)                                              /*!< CAN_IF_T::ARB2: DIR Position           */
#define CAN_IF_ARB2_DIR_Msk              (0x1ul << CAN_IF_ARB2_DIR_Pos)                    /*!< CAN_IF_T::ARB2: DIR Mask               */

#define CAN_IF_ARB2_XTD_Pos              (14)                                              /*!< CAN_IF_T::ARB2: XTD Position           */
#define CAN_IF_ARB2_XTD_Msk              (0x1ul << CAN_IF_ARB2_XTD_Pos)                    /*!< CAN_IF_T::ARB2: XTD Mask               */

#define CAN_IF_ARB2_MSGVAL_Pos           (15)                                              /*!< CAN_IF_T::ARB2: MSGVAL Position        */
#define CAN_IF_ARB2_MSGVAL_Msk           (0x1ul << CAN_IF_ARB2_MSGVAL_Pos)                 /*!< CAN_IF_T::ARB2: MSGVAL Mask            */

#define CAN_IF_MCON_DLC_Pos              (0)                                               /*!< CAN_IF_T::MCON: DLC Position           */
#define CAN_IF_MCON_DLC_Msk              (0xful << CAN_IF_MCON_DLC_Pos)                    /*!< CAN_IF_T::MCON: DLC Mask               */

#define CAN_IF_MCON_EOB_Pos              (7)                                               /*!< CAN_IF_T::MCON: EOB Position           */
#define CAN_IF_MCON_EOB_Msk              (0x1ul << CAN_IF_MCON_EOB_Pos)                    /*!< CAN_IF_T::MCON: EOB Mask               */

#define CAN_IF_MCON_TXRQST_Pos           (8)                                               /*!< CAN_IF_T::MCON: TXRQST Position        */
#define CAN_IF_MCON_TXRQST_Msk           (0x1ul << CAN_IF_MCON_TXRQST_Pos)                 /*!< CAN_IF_T::MCON: TXRQST Mask            */

#define CAN_IF_MCON_RMTEN_Pos            (9)                                               /*!< CAN_IF_T::MCON: RMTEN Position         */
#define CAN_IF_MCON_RMTEN_Msk            (0x1ul << CAN_IF_MCON_RMTEN_Pos)                  /*!< CAN_IF_T::MCON: RMTEN Mask             */

#define CAN_IF_MCON_RXIE_Pos             (10)                                              /*!< CAN_IF_T::MCON: RXIE Position          */
#define CAN_IF_MCON_RXIE_Msk             (0x1ul << CAN_IF_MCON_RXIE_Pos)                   /*!< CAN_IF_T::MCON: RXIE Mask              */

#define CAN_IF_MCON_TXIE_Pos             (11)                                              /*!< CAN_IF_T::MCON: TXIE Position          */
#define CAN_IF_MCON_TXIE_Msk             (0x1ul << CAN_IF_MCON_TXIE_Pos)                   /*!< CAN_IF_T::MCON: TXIE Mask              */

#define CAN_IF_MCON_UMASK_Pos            (12)                                              /*!< CAN_IF_T::MCON: UMASK Position         */
#define CAN_IF_MCON_UMASK_Msk            (0x1ul << CAN_IF_MCON_UMASK_Pos)                  /*!< CAN_IF_T::MCON: UMASK Mask             */

#define CAN_IF_MCON_INTPND_Pos           (13)                                              /*!< CAN_IF_T::MCON: INTPND Position        */
#define CAN_IF_MCON_INTPND_Msk           (0x1ul << CAN_IF_MCON_INTPND_Pos)                 /*!< CAN_IF_T::MCON: INTPND Mask            */

#define CAN_IF_MCON_MSGLST_Pos           (14)                                              /*!< CAN_IF_T::MCON: MSGLST Position        */
#define CAN_IF_MCON_MSGLST_Msk           (0x1ul << CAN_IF_MCON_MSGLST_Pos)                 /*!< CAN_IF_T::MCON: MSGLST Mask            */

#define CAN_IF_MCON_NEWDAT_Pos           (15)                                              /*!< CAN_IF_T::MCON: NEWDAT Position        */
#define CAN_IF_MCON_NEWDAT_Msk           (0x1ul << CAN_IF_MCON_NEWDAT_Pos)                 /*!< CAN_IF_T::MCON: NEWDAT Mask            */

#define CAN_IF_DAT_A1_DATA0_Pos          (0)                                               /*!< CAN_IF_T::DAT_A1: DATA0 Position       */
#define CAN_IF_DAT_A1_DATA0_Msk          (0xfful << CAN_IF_DAT_A1_DATA0_Pos)               /*!< CAN_IF_T::DAT_A1: DATA0 Mask           */

#define CAN_IF_DAT_A1_DATA1_Pos          (8)                                               /*!< CAN_IF_T::DAT_A1: DATA1 Position       */
#define CAN_IF_DAT_A1_DATA1_Msk          (0xfful << CAN_IF_DAT_A1_DATA1_Pos)               /*!< CAN_IF_T::DAT_A1: DATA1 Mask           */

