wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/can_reg.h
#define CAN_IF_DAT_A2_DATA2_Pos          (0)                                               /*!< CAN_IF_T::DAT_A2: DATA2 Position       */
#define CAN_IF_DAT_A2_DATA2_Msk          (0xfful << CAN_IF_DAT_A2_DATA2_Pos)               /*!< CAN_IF_T::DAT_A2: DATA2 Mask           */

#define CAN_IF_DAT_A2_DATA3_Pos          (8)                                               /*!< CAN_IF_T::DAT_A2: DATA3 Position       */
#define CAN_IF_DAT_A2_DATA3_Msk          (0xfful << CAN_IF_DAT_A2_DATA3_Pos)               /*!< CAN_IF_T::DAT_A2: DATA3 Mask           */

#define CAN_IF_DAT_B1_DATA4_Pos          (0)                                               /*!< CAN_IF_T::DAT_B1: DATA4 Position       */
#define CAN_IF_DAT_B1_DATA4_Msk          (0xfful << CAN_IF_DAT_B1_DATA4_Pos)               /*!< CAN_IF_T::DAT_B1: DATA4 Mask           */

#define CAN_IF_DAT_B1_DATA5_Pos          (8)                                               /*!< CAN_IF_T::DAT_B1: DATA5 Position       */
#define CAN_IF_DAT_B1_DATA5_Msk          (0xfful << CAN_IF_DAT_B1_DATA5_Pos)               /*!< CAN_IF_T::DAT_B1: DATA5 Mask           */

#define CAN_IF_DAT_B2_DATA6_Pos          (0)                                               /*!< CAN_IF_T::DAT_B2: DATA6 Position       */
#define CAN_IF_DAT_B2_DATA6_Msk          (0xfful << CAN_IF_DAT_B2_DATA6_Pos)               /*!< CAN_IF_T::DAT_B2: DATA6 Mask           */

#define CAN_IF_DAT_B2_DATA7_Pos          (8)                                               /*!< CAN_IF_T::DAT_B2: DATA7 Position       */
#define CAN_IF_DAT_B2_DATA7_Msk          (0xfful << CAN_IF_DAT_B2_DATA7_Pos)               /*!< CAN_IF_T::DAT_B2: DATA7 Mask           */

#define CAN_TXREQ1_TXRQST_Pos            (0)                                               /*!< CAN_T::TXREQ1: TXRQST Position         */
#define CAN_TXREQ1_TXRQST_Msk            (0xfffful << CAN_TXREQ1_TXRQST_Pos)               /*!< CAN_T::TXREQ1: TXRQST Mask             */

#define CAN_TXREQ2_TXRQST_Pos            (0)                                               /*!< CAN_T::TXREQ2: TXRQST Position         */
#define CAN_TXREQ2_TXRQST_Msk            (0xfffful << CAN_TXREQ2_TXRQST_Pos)               /*!< CAN_T::TXREQ2: TXRQST Mask             */

#define CAN_NDAT1_NEWDATA_Pos            (0)                                               /*!< CAN_T::NDAT1: NEWDATA Position         */
#define CAN_NDAT1_NEWDATA_Msk            (0xfffful << CAN_NDAT1_NEWDATA_Pos)               /*!< CAN_T::NDAT1: NEWDATA Mask             */

#define CAN_NDAT2_NEWDATA_Pos            (0)                                               /*!< CAN_T::NDAT2: NEWDATA Position         */
#define CAN_NDAT2_NEWDATA_Msk            (0xfffful << CAN_NDAT2_NEWDATA_Pos)               /*!< CAN_T::NDAT2: NEWDATA Mask             */

#define CAN_IPND1_INTPND_Pos             (0)                                               /*!< CAN_T::IPND1: INTPND Position          */
#define CAN_IPND1_INTPND_Msk             (0xfffful << CAN_IPND1_INTPND_Pos)                /*!< CAN_T::IPND1: INTPND Mask              */

#define CAN_IPND2_INTPND_Pos             (0)                                               /*!< CAN_T::IPND2: INTPND Position          */
#define CAN_IPND2_INTPND_Msk             (0xfffful << CAN_IPND2_INTPND_Pos)                /*!< CAN_T::IPND2: INTPND Mask              */

#define CAN_MVLD1_MSGVAL_Pos             (0)                                               /*!< CAN_T::MVLD1: MSGVAL Position          */
#define CAN_MVLD1_MSGVAL_Msk             (0xfffful << CAN_MVLD1_MSGVAL_Pos)                /*!< CAN_T::MVLD1: MSGVAL Mask              */

#define CAN_MVLD2_MSGVAL_Pos             (0)                                               /*!< CAN_T::MVLD2: MSGVAL Position          */
#define CAN_MVLD2_MSGVAL_Msk             (0xfffful << CAN_MVLD2_MSGVAL_Pos)                /*!< CAN_T::MVLD2: MSGVAL Mask              */

#define CAN_WU_EN_WAKUP_EN_Pos           (0)                                               /*!< CAN_T::WU_EN: WAKUP_EN Position        */
#define CAN_WU_EN_WAKUP_EN_Msk           (0x1ul << CAN_WU_EN_WAKUP_EN_Pos)                 /*!< CAN_T::WU_EN: WAKUP_EN Mask            */

#define CAN_WU_STATUS_WAKUP_STS_Pos      (0)                                               /*!< CAN_T::WU_STATUS: WAKUP_STS Position   */
#define CAN_WU_STATUS_WAKUP_STS_Msk      (0x1ul << CAN_WU_STATUS_WAKUP_STS_Pos)            /*!< CAN_T::WU_STATUS: WAKUP_STS Mask       */

#define CAN_STSEL_TXHS_Pos               (0)                                               /*!< CAN_T::STSEL: TXHS Position            */
#define CAN_STSEL_TXHS_Msk               (0x7ul << CAN_STSEL_TXHS_Pos)                     /*!< CAN_T::STSEL: TXHS Mask                */

#define CAN_STSEL_TXLS_Pos               (4)                                               /*!< CAN_T::STSEL: TXLS Position            */
#define CAN_STSEL_TXLS_Msk               (0x7ul << CAN_STSEL_TXLS_Pos)                     /*!< CAN_T::STSEL: TXLS Mask                */

/**@}*/ /* CAN_CONST */
/**@}*/ /* end of CAN register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __CAN_REG_H__ */
